
__author__ = 'Субботин Андрей Владимирович'

from math import sqrt

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

num = 7854632568455841123657
max_num = 0

while num:
    num_element = num % 10
    if num_element == 9:
        print("Maximum number is 9")
        break
    else:
        if num_element > max_num:
            max_num = num_element
    num = num // 10
else:
    print(max_num)

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

a = input('Enter first number: \n')
b = input('Enter second number: \n')

a, b = b, a
print ('Now first number is: ', a, ' and the secoend is: ', b)

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

print('Введите коэффициенты для квадратного уравнения (ax² + bx + c = 0):')
a = float(input('a =\n '))
b = float(input('b =\n '))
c = float(input('c =\n '))

discr = b ** 2 - 4 * a * c
print('Дискриминант D = %.2f' % discr)

if discr > 0:
    x1 = (-b + sqrt(discr)) / (2 * a)
    x2 = (-b - sqrt(discr)) / (2 * a)
    print('x1 = %.2f \nx2 = %.2f' % (x1, x2))
elif discr == 0:
    x = -b / (2 * a)
    print('x = %.2f' % x)
else:
    print('Корней нет')
